<a href="https://colab.research.google.com/github/jessicarodrigues21/desafio_sql/blob/main/cliente_compras.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import sqlite3

conn = sqlite3.connect('cliente.db')
print('Conexão aberta!')

conn.execute('CREATE TABLE clientes(id INT PRIMARY KEY, nome VARCHAR(100), idade INT, saldo FLOAT)')

conn.commit()

Conexão aberta!

In [2]:
conn.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES(1, "Carlos Silva", 34, 1500.50)')
conn.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES(2, "Maria Fernanda", 28, 2500.00)')
conn.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES(3, "João Pereira", 45, 3000.75)')
conn.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES(4, "Ana Carolina", 32, 1800.20)')

conn.commit()

In [3]:
dados = conn.execute('SELECT AVG(saldo) AS saldo_medio FROM clientes;')
for clientes in dados:
    print(clientes)

(2200.3625,)

In [5]:
dados = conn.execute('SELECT nome, MAX(saldo) AS saldo_maximo FROM clientes GROUP BY nome ORDER BY saldo_maximo DESC LIMIT 1;')
for clientes in dados:
    print(clientes)

('João Pereira', 3000.75)

In [6]:
dados = conn.execute('SELECT COUNT(*) AS acima_de_1000 FROM clientes WHERE saldo > 1000')
for clientes in dados:
    print(clientes)

(4,)

In [7]:
dados = conn.execute('UPDATE clientes SET saldo = 2000 WHERE id = 3')
for clientes in dados:
    print(clientes)

In [9]:
dados = conn.execute('DELETE FROM clientes WHERE id = 2')
for clientes in dados:
    print(clientes)

In [ ]:

for clientes in dados:
    print(clientes)

In [ ]:
conn.execute('CREATE TABLE compras(id INT PRIMARY KEY, cliente_id INT, produto TEXT, valor REAL, FOREIGN KEY (cliente_id) REFERENCES clientes(id))')

In [ ]:
conn.execute('INSERT INTO compras (id, cliente_id, produto, valor) VALUES(1, 1, "Livro de SQL", 50.00)')
conn.execute('INSERT INTO compras (id, cliente_id, produto, valor) VALUES(2, 2, "Mouse sem fio", 30.00)')
conn.execute('INSERT INTO compras (id, cliente_id, produto, valor) VALUES(3, 1, "Teclado mecânico", 120.00)')
conn.execute('INSERT INTO compras (id, cliente_id, produto, valor) VALUES(4, 3, "Monitor 24 polegadas", 300.00)')
conn.execute('INSERT INTO compras (id, cliente_id, produto, valor) VALUES(5, 2, "Carregador portátil", 25.00)')

In [12]:
dados = conn.execute('SELECT c.nome, p.produto, p.valor FROM compras p JOIN clientes c ON p.cliente_id = c.id')
for clientes in dados:
    print(clientes)

('Carlos Silva', 'Livro de SQL', 50.0)
('Carlos Silva', 'Teclado mecânico', 120.0)
('João Pereira', 'Monitor 24 polegadas', 300.0)